99_testCase_simpleFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    allBoundary
    {
        type            patch;
        nFaces          162;
        startFace       24427;
    }
    wall1
    {
        type            wall;
        inGroups        List<word> 
2
(
meshedWalls
wall
)
;
        nFaces          2077;
        startFace       24589;
    }
    stirrer
    {
        type            wall;
        inGroups        List<word> 
2
(
meshedWalls
wall
)
;
        nFaces          346;
        startFace       26666;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 
2
(
meshedWalls
wall
)
;
        nFaces          586;
        startFace       27012;
    }
)

// ************************************************************************* //
