99_testCase_simpleFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    bottom
    {
        type            noSlip;
    }
   
    wall
    {
        type            noSlip;
    }  
    
    stirrer
    {
        type            rotatingWallVelocity;
	origin		(0 0 0);
	axis 		(0 1 0); 
	omega		-12.566371;
    } 
   
    top
    {
        type            symmetry;
    } 
}
// ************************************************************************* //
