99_testCase_simpleFoam/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{

    Behaelter
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    DO
    {
        type            omegaWallFunction;
        value           $internalField;
    }


    PH
    {
        type            omegaWallFunction;
        value           $internalField;
    }


    PNR
    {
        type            omegaWallFunction;
        value           $internalField;
    }


    PT100
    {
        type            omegaWallFunction;
        value           $internalField;
    }


    Ruehrer
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    Ruehrer1
    {
        type            omegaWallFunction;
        value           $internalField;
    }


    PNR1 
    {
        type            omegaWallFunction;
        value           $internalField;
    }


    Top
    {
        type		symmetry;
    }



}


// ************************************************************************* //
